app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 3]]
---
        <ul>
          <% recipe.ingredients.each do |ingredient| %>