app/controllers/recipes_controller.rb

  def show
    cuisine = params.permit(:cuisine)[:cuisine]
    ingredient_name = params.permit(:ingredient)[:ingredient]

    @recipes ||=
    if cuisine.present? && ingredient_name.present?
      Recipe.filter_by_cuisine_and_ingredient_name(cuisine, ingredient_name)
    elsif cuisine.present?
      Recipe.filter_by_cuisine(cuisine)
    elsif ingredient_name.present?
      Recipe.filter_by_ingredient_name(ingredient_name)
    else
      Recipe.all
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ? ORDER BY "ingredients"."id" DESC LIMIT ?  [["recipe_id", 2], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"